spec/fixtures/vcr/Jackpot_Payment/_create/with_invalid_token_information/raises_an_unauthorized_token_information.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body: username=demo&password=password&type=auth&orderid=&customer_vault_id=1&currency=USD&tax=&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Fri, 10 Feb 2012 01:12:44 GMT
      server:
      - Apache
      content-length:
      - '208'
      connection:
      - close
      content-type:
      - text/html
    body: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1561145817&avsresponse=N&cvvresponse=&orderid=&type=auth&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=1
    http_version: '1.1'
  recorded_at: Fri, 10 Feb 2012 01:12:46 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body: username=demo&password=password&type=capture&transactionid=1561145817&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Fri, 10 Feb 2012 01:12:48 GMT
      server:
      - Apache
      content-length:
      - '209'
      connection:
      - close
      content-type:
      - text/html
    body: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1561145817&avsresponse=&cvvresponse=&orderid=&type=capture&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=
    http_version: '1.1'
  recorded_at: Fri, 10 Feb 2012 01:12:50 GMT
recorded_with: VCR 2.0.0.rc1
