spec/fixtures/vcr/Jackpot_Payment/_create/with_valid_token_information/records_the_payment_transaction_id_for_future_reference.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body: username=demo&password=password&type=auth&orderid=&customer_vault_id=977656792&currency=USD&tax=&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Thu, 09 Feb 2012 22:31:19 GMT
      server:
      - Apache
      content-length:
      - '209'
      connection:
      - close
      content-type:
      - text/html
    body: response=2&responsetext=DECLINE&authcode=&transactionid=1561055491&avsresponse=&cvvresponse=&orderid=&type=auth&response_code=200&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=977656792
    http_version: '1.1'
  recorded_at: Thu, 09 Feb 2012 22:31:21 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body: username=demo&password=password&type=capture&transactionid=1561055491&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Thu, 09 Feb 2012 22:31:23 GMT
      server:
      - Apache
      content-length:
      - '271'
      connection:
      - close
      content-type:
      - text/html
    body: response=3&responsetext=A capture requires that the existing transaction
      be an AUTH REFID:326941287&authcode=&transactionid=1561055491&avsresponse=&cvvresponse=&orderid=&type=capture&response_code=300&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=
    http_version: '1.1'
  recorded_at: Thu, 09 Feb 2012 22:31:23 GMT
recorded_with: VCR 2.0.0.rc1
